BOT_TOKEN = '7969025390:AAG62t2wUCOAvc3-ZnVkcKqGoNYOslLDpLA'

DISCORD_WEBHOOK_URL = "https://discordapp.com/api/webhooks/1368522950122274826/-YvDAyigkxjv65RcFctcDFb-naw0W2taAQS_DTL_QhuK6VGGFCp4rR0qg07RmIbt6pBW"


DATA_FILE = "Bot_data.json"  # Файл для зберігання даних



FAQ_FILE = "faq.xlsx"


# словник для відстеження кулдауна
last_report_time = {}


# Словник для зберігання попереджень користувачів
warnings = {}
banned_users = set()  # Множина для зберігання забанених користувачів

muted_users = {}

# Словник замін для відновлення букв (укр <-> англ)
letters_rest_table = {
    'а': ['a', '@', '4'],
    'б': ['b', '6'],
    'в': ['v', 'w'],
    'г': ['h', 'g'],
    'ґ': ['g'],
    'д': ['d'],
    'е': ['e', '3'],
    'є': ['ye', 'je', 'e'],
    'ж': ['zh', 'j'],
    'з': ['z', '3'],
    'и': ['y', 'i'],
    'і': ['i', '1', '!'],
    'ї': ['yi', 'ji', 'i'],
    'й': ['i', 'y', 'j'],
    'к': ['k', 'c', 'q'],
    'л': ['l', '1', '|'],
    'м': ['m'],
    'н': ['n', 'h'],
    'о': ['o', '0'],
    'п': ['p'],
    'р': ['r', 'p'],
    'с': ['s', 'c', '$', '5'],
    'т': ['t', '7'],
    'у': ['u', 'y'],
    'ф': ['f', 'ph'],
    'х': ['h', 'x', 'kh'],
    'ц': ['c', 'ts'],
    'ч': ['ch', '4'],
    'ш': ['sh'],
    'щ': ['sch', 'shh'],
    'ь': ["'", "`"],
    'ю': ['yu', 'ju', 'u'],
    'я': ['ya', 'ja'],
}

# Спецсимволи, які часто підміняють букви
special_symbols_map = {
    '@': 'а',
    '!' : 'і',
    '1' : 'і',
    '3' : 'з',
    '0' : 'о',
    '$' : 'с',
    '#' : 'ш',
    '*' : '',
    '-' : '',
    '_' : '',
}

