BOT_TOKEN = '8072115645:AAFJFbStgQlX9cPRB0_Hx4wKKT5WZnrFNRQ'

admin_chat_id = '-1002405269620'  # ID адміністратора

# Словник для зберігання попереджень користувачів
warnings = {}
KARMA_FILE = "karma.json"

# Налаштування карми
MIN_KARMA = -999
MAX_KARMA = 999
DEFAULT_USER_KARMA = 0  # Початкове значення карми для звичайних користувачів
DEFAULT_ADMIN_KARMA = 999  # Початкове значення карми для адміністраторів

# Карта статусів користувачів
status_map = {
    "creator": "Власник",
    "administrator": "Адмін",
    "member": "Учасник",
    "left": "Покинув чат",
    "kicked": "Заблокований"
}

# Таблиця замін для транслітерації
replacements = {
    'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ё': 'e', 'ж': 'zh', 'з': 'z', 'и': 'i',
    'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't',
    'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'ts', 'ч': 'ch', 'ш': 'sh', 'щ': 'sch', 'ы': 'y', 'э': 'e', 'ю': 'yu',
    'я': 'ya', 'і': 'i', 'ї': 'yi', 'є': 'ye'
}

# Регулярні вирази для заборонених слів
BAD_WORDS_REGEX = [
    r"(с[\W_]*[уy][\W_]*[кk][\W_]*[аa@])",  # с у к а
    r"(б[\W_]*[лl][\W_]*[яy][\W_]*[тt])"   # б л я т
]