BOT_TOKEN = '8072115645:AAFJFbStgQlX9cPRB0_Hx4wKKT5WZnrFNRQ'

DISCORD_WEBHOOK_URL = "https://discordapp.com/api/webhooks/1368522950122274826/-YvDAyigkxjv65RcFctcDFb-naw0W2taAQS_DTL_QhuK6VGGFCp4rR0qg07RmIbt6pBW"


DATA_FILE = "Bot_data.json"  # Файл для зберігання даних

# Словник для зберігання попереджень користувачів
warnings = {}
banned_users = set()  # Множина для зберігання забанених користувачів
# Словник для зберігання карми користувачів
user_karma = {}

muted_users = {}

# Заборонені слова українською мовою
BAD_WORDS = ["пиздець", "хуй", "блядь", "сучка", "гандон", "їбать", "п@!ц", "пизд"]

# Карта статусів користувачів
status_map = {
    "creator": "Власник",
    "administrator": "Адмін",
    "member": "Учасник",
    "left": "Покинув чат",
    "kicked": "Заблокований"
}

# Таблиця замін для транслітерації
replacements = {
    'а': 'a', 'б': 'b', 'в': 'v', 'г': 'g', 'д': 'd', 'е': 'e', 'ё': 'e', 'ж': 'zh', 'з': 'z', 'и': 'i',
    'й': 'y', 'к': 'k', 'л': 'l', 'м': 'm', 'н': 'n', 'о': 'o', 'п': 'p', 'р': 'r', 'с': 's', 'т': 't',
    'у': 'u', 'ф': 'f', 'х': 'h', 'ц': 'ts', 'ч': 'ch', 'ш': 'sh', 'щ': 'sch', 'ы': 'y', 'э': 'e', 'ю': 'yu',
    'я': 'ya', 'і': 'i', 'ї': 'yi', 'є': 'ye'
}

# Регулярні вирази для заборонених слів
BAD_WORDS_REGEX = [
    r"(с[\W_]*[уy][\W_]*[кk][\W_]*[аa@])",  # с у к а
    r"(б[\W_]*[лl][\W_]*[яy][\W_]*[тt])"   # б л я т
]